src/cf/InformationRegisters/Infor_ОчередьВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Infor_ОчередьВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Infor_СтатусВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Infor_Ошибки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Infor_Ошибки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Уникальность</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Infor_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Infor_СтатусыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Infor_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Infor_ИсторияСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Infor_ИсторияСтатусовОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Infor_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Infor_ИсторияСтатусовВМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Infor_ИсторияСтатусовВМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/Infor_Информация/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектИнформации = Параметры.ОбъектИнформации;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_ОчередьВыгрузки.Объект,
	               |	Infor_ОчередьВыгрузки.КоличествоПопытокВыгрузки,
	               |	Infor_ОчередьВыгрузки.Приоритет,
	               |	Infor_ОчередьВыгрузки.СтатусВыгрузки,
	               |	Infor_ОчередьВыгрузки.Ошибка
	               |ИЗ
	               |	РегистрСведений.Infor_ОчередьВыгрузки КАК Infor_ОчередьВыгрузки
	               |ГДЕ
	               |	Infor_ОчередьВыгрузки.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокОчередьОбмена.Добавить();
		НС.Объект = Выборка.Объект;
		НС.КоличествоПопытокВыгрузки = Выборка.КоличествоПопытокВыгрузки;
		НС.Приоритет = Выборка.Приоритет;
		НС.СтатусВыгрузки = Выборка.СтатусВыгрузки;
		НС.Ошибка = Выборка.Ошибка;		
	КонецЦикла;
	
	ТекстОшибки = "";
	Connection = Неопределено;
	Попытка
		Infor_Интеграция.ПолучитьПодключениеБД(Connection);
		Преф = Infor_Интеграция.ПолучитьПрефиксОбъека(ОбъектИнформации)+"_";
		ТекстНомера = Infor_Интеграция._ПолучитьНомерВМС(Преф, ОбъектИнформации);
		
		ТекстSQL = "SELECT
		|RecordId,
		|'dbo.ImpOutputOrdersShippingFromWMS_'
		|FROM [BUFER].[dbo].[ImpOutputOrdersShippingFromWMS] (nolock)
		|WHERE Docid = '" + ТекстНомера + "'
		|UNION ALL
		|SELECT
		|RecordId,
		|'dbo.ImpInputOrdersFromWMS_'
		|FROM [BUFER].[dbo].[ImpInputOrdersFromWMS] (nolock)
		|WHERE Docid = '" + ТекстНомера + "'";
		RS = Connection.Execute(ТекстSQL);
		Пока RS.EOF = 0 Цикл
			ТекстОшибки = СокрЛП(RS.Fields(1).Value)+СтрЗаменить(СокрЛП(RS.Fields(0).Value),Символы.НПП,"");
			RS.MoveNext();
		КонецЦикла;
		RS.Close();
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Infor_Ошибки.ДатаОшибки КАК ДатаОшибки,
	               |	Infor_Ошибки.ОбъектОшибки,
	               |	Infor_Ошибки.ПричинаОшибки
	               |ИЗ
	               |	РегистрСведений.Infor_Ошибки КАК Infor_Ошибки
	               |ГДЕ
	               |	Infor_Ошибки.ОбъектОшибки = &ОбъектОшибки";
	Если ТекстОшибки <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ИЛИ Infor_Ошибки.ОбъектОшибки = &ТекстОшибки";
		Запрос.УстановитьПараметр("ТекстОшибки", ТекстОшибки);
	Иначе
		
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОшибки УБЫВ";
	Запрос.УстановитьПараметр("ОбъектОшибки", ОбъектИнформации);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокОшибкиОбмена.Добавить();
		НС.ДатаОшибки = Выборка.ДатаОшибки;
		НС.ОбъектОшибки = Выборка.ОбъектОшибки;
		НС.ПричинаОшибка = Выборка.ПричинаОшибки;		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_СтатусыОбъектов.Объект,
	               |	Infor_СтатусыОбъектов.СтатусОбъекта
	               |ИЗ
	               |	РегистрСведений.Infor_СтатусыОбъектов КАК Infor_СтатусыОбъектов
	               |ГДЕ
	               |	Infor_СтатусыОбъектов.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокСтатусОбмена.Добавить();
		НС.Объект = Выборка.Объект;
		НС.СтатусОбъекта = Выборка.СтатусОбъекта;	
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_ИсторияСтатусовОбъектов.Объект,
	               |	Infor_ИсторияСтатусовОбъектов.СтатусОбъекта,
	               |	Infor_ИсторияСтатусовОбъектов.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	РегистрСведений.Infor_ИсторияСтатусовОбъектов КАК Infor_ИсторияСтатусовОбъектов
	               |ГДЕ
	               |	Infor_ИсторияСтатусовОбъектов.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИзменения";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокИсторияСтатусов.Добавить();
		НС.Объект = Выборка.Объект;
		НС.ДатаИзменения = Выборка.ДатаИзменения;
		НС.СтатусОбъекта = Выборка.СтатусОбъекта;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Infor_ИсторияСтатусовВМС.Объект,
	               |	Infor_ИсторияСтатусовВМС.СтатусОбъекта,
	               |	Infor_ИсторияСтатусовВМС.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	РегистрСведений.Infor_ИсторияСтатусовВМС КАК Infor_ИсторияСтатусовВМС
	               |ГДЕ
	               |	Infor_ИсторияСтатусовВМС.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИзменения УБЫВ";
	Запрос.УстановитьПараметр("Объект", ОбъектИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = СписокСтатусВМС.Добавить();
		НС.Объект = Выборка.Объект;
		НС.ДатаИзменения = Выборка.ДатаИзменения;
		НС.СтатусОбъекта = Выборка.СтатусОбъекта;
	КонецЦикла;
КонецПроцедуры
